sebanc/brunch/external-drivers/rtl8723du/core/rtw_xmit.c
	ptxservq = rtw_get_sta_pending(adapt, psta, pattrib->priority, (u8 *)(&ac_index));

	/* _enter_critical(&pstapending->lock, &irqL0); */

	if (rtw_is_list_empty(&ptxservq->tx_pending))
		list_add_tail(&ptxservq->tx_pending, get_list_head(phwxmits[ac_index].sta_queue));

	/* _enter_critical(&ptxservq->sta_pending.lock, &irqL1); */

	list_add_tail(&pxmitframe->list, get_list_head(&ptxservq->sta_pending));
	ptxservq->qcnt++;
	phwxmits[ac_index].accnt++;

	/* _exit_critical(&ptxservq->sta_pending.lock, &irqL1); */

	/* _exit_critical(&pstapending->lock, &irqL0); */

exit:


	return res;
}

void rtw_alloc_hwxmits(struct adapter *adapt)
{
	struct hw_xmit *hwxmits;
	struct xmit_priv *pxmitpriv = &adapt->xmitpriv;

	pxmitpriv->hwxmit_entry = HWXMIT_ENTRY;

	pxmitpriv->hwxmits = NULL;

	pxmitpriv->hwxmits = (struct hw_xmit *)rtw_zmalloc(sizeof(struct hw_xmit) * pxmitpriv->hwxmit_entry);

	if (!pxmitpriv->hwxmits) {
		RTW_INFO("alloc hwxmits fail!...\n");
		return;
	}

	hwxmits = pxmitpriv->hwxmits;

	if (pxmitpriv->hwxmit_entry == 5) {
		/* pxmitpriv->bmc_txqueue.head = 0; */
		/* hwxmits[0] .phwtxqueue = &pxmitpriv->bmc_txqueue; */
		hwxmits[0] .sta_queue = &pxmitpriv->bm_pending;

		/* pxmitpriv->vo_txqueue.head = 0; */
		/* hwxmits[1] .phwtxqueue = &pxmitpriv->vo_txqueue; */
		hwxmits[1] .sta_queue = &pxmitpriv->vo_pending;

		/* pxmitpriv->vi_txqueue.head = 0; */
		/* hwxmits[2] .phwtxqueue = &pxmitpriv->vi_txqueue; */
		hwxmits[2] .sta_queue = &pxmitpriv->vi_pending;

		/* pxmitpriv->bk_txqueue.head = 0; */
		/* hwxmits[3] .phwtxqueue = &pxmitpriv->bk_txqueue; */
		hwxmits[3] .sta_queue = &pxmitpriv->bk_pending;

		/* pxmitpriv->be_txqueue.head = 0; */
		/* hwxmits[4] .phwtxqueue = &pxmitpriv->be_txqueue; */
		hwxmits[4] .sta_queue = &pxmitpriv->be_pending;

	} else if (pxmitpriv->hwxmit_entry == 4) {

		/* pxmitpriv->vo_txqueue.head = 0; */
		/* hwxmits[0] .phwtxqueue = &pxmitpriv->vo_txqueue; */
		hwxmits[0] .sta_queue = &pxmitpriv->vo_pending;

		/* pxmitpriv->vi_txqueue.head = 0; */
		/* hwxmits[1] .phwtxqueue = &pxmitpriv->vi_txqueue; */
		hwxmits[1] .sta_queue = &pxmitpriv->vi_pending;

		/* pxmitpriv->be_txqueue.head = 0; */
		/* hwxmits[2] .phwtxqueue = &pxmitpriv->be_txqueue; */
		hwxmits[2] .sta_queue = &pxmitpriv->be_pending;

		/* pxmitpriv->bk_txqueue.head = 0; */
		/* hwxmits[3] .phwtxqueue = &pxmitpriv->bk_txqueue; */
		hwxmits[3] .sta_queue = &pxmitpriv->bk_pending;
	} else {


	}


}

void rtw_free_hwxmits(struct adapter *adapt)
{
	struct hw_xmit *hwxmits;
	struct xmit_priv *pxmitpriv = &adapt->xmitpriv;

	hwxmits = pxmitpriv->hwxmits;
	if (hwxmits)
		rtw_mfree((u8 *)hwxmits, (sizeof(struct hw_xmit) * pxmitpriv->hwxmit_entry));
}

void rtw_init_hwxmits(struct hw_xmit *phwxmit, int entry)
{
	int i;
	for (i = 0; i < entry; i++, phwxmit++) {
		/* spin_lock_init(&phwxmit->xmit_lock); */
		/* INIT_LIST_HEAD(&phwxmit->pending);		 */
		/* phwxmit->txcmdcnt = 0; */
		phwxmit->accnt = 0;
	}
}

static int rtw_br_client_tx(struct adapter *adapt, struct sk_buff **pskb)
{
	struct sk_buff *skb = *pskb;
	unsigned long irqL;
	int res, is_vlan_tag = 0, i, do_nat25 = 1;
	unsigned short vlan_hdr = 0;
	void *br_port = NULL;

#if (LINUX_VERSION_CODE <= KERNEL_VERSION(2, 6, 35))
	br_port = adapt->pnetdev->br_port;
#else   /* (LINUX_VERSION_CODE <= KERNEL_VERSION(2, 6, 35)) */
	rcu_read_lock();
	br_port = rcu_dereference(adapt->pnetdev->rx_handler_data);
	rcu_read_unlock();
#endif /* (LINUX_VERSION_CODE <= KERNEL_VERSION(2, 6, 35)) */
	_enter_critical_bh(&adapt->br_ext_lock, &irqL);
	if (!(skb->data[0] & 1) &&
	    br_port &&
	    memcmp(skb->data + MACADDRLEN, adapt->br_mac, MACADDRLEN) &&
	    *((__be16 *)(skb->data + MACADDRLEN * 2)) != __constant_htons(ETH_P_8021Q) &&
	    *((__be16 *)(skb->data + MACADDRLEN * 2)) == __constant_htons(ETH_P_IP) &&
	    !memcmp(adapt->scdb_mac, skb->data + MACADDRLEN, MACADDRLEN) && adapt->scdb_entry) {
		memcpy(skb->data + MACADDRLEN, GET_MY_HWADDR(adapt), MACADDRLEN);
		adapt->scdb_entry->ageing_timer = jiffies;
		_exit_critical_bh(&adapt->br_ext_lock, &irqL);
	} else
		/* if (!priv->pmib->ethBrExtInfo.nat25_disable)		 */
	{
		/*			if (priv->dev->br_port &&
		 *				 !memcmp(skb->data+MACADDRLEN, priv->br_mac, MACADDRLEN)) { */
		if (*((__be16 *)(skb->data + MACADDRLEN * 2)) == __constant_htons(ETH_P_8021Q)) {
			is_vlan_tag = 1;
			vlan_hdr = *((unsigned short *)(skb->data + MACADDRLEN * 2 + 2));
			for (i = 0; i < 6; i++)
				*((unsigned short *)(skb->data + MACADDRLEN * 2 + 2 - i * 2)) = *((unsigned short *)(skb->data + MACADDRLEN * 2 - 2 - i * 2));
			skb_pull(skb, 4);
		}
		/* if SA == br_mac && skb== IP  => copy SIP to br_ip ?? why */
		if (!memcmp(skb->data + MACADDRLEN, adapt->br_mac, MACADDRLEN) &&
		    (*((__be16 *)(skb->data + MACADDRLEN * 2)) == __constant_htons(ETH_P_IP)))
			memcpy(adapt->br_ip, skb->data + WLAN_ETHHDR_LEN + 12, 4);

		if (*((__be16 *)(skb->data + MACADDRLEN * 2)) == __constant_htons(ETH_P_IP)) {
			if (memcmp(adapt->scdb_mac, skb->data + MACADDRLEN, MACADDRLEN)) {
				adapt->scdb_entry = (struct nat25_network_db_entry *)scdb_findEntry(adapt,
					skb->data + MACADDRLEN, skb->data + WLAN_ETHHDR_LEN + 12);
				if (adapt->scdb_entry) {
					memcpy(adapt->scdb_mac, skb->data + MACADDRLEN, MACADDRLEN);
					memcpy(adapt->scdb_ip, skb->data + WLAN_ETHHDR_LEN + 12, 4);
					adapt->scdb_entry->ageing_timer = jiffies;
					do_nat25 = 0;
				}
			} else {
				if (adapt->scdb_entry) {
					adapt->scdb_entry->ageing_timer = jiffies;
					do_nat25 = 0;
				} else {
					memset(adapt->scdb_mac, 0, MACADDRLEN);
					memset(adapt->scdb_ip, 0, 4);
				}
			}
		}
		_exit_critical_bh(&adapt->br_ext_lock, &irqL);
		if (do_nat25) {
			if (nat25_db_handle(adapt, skb, NAT25_CHECK) == 0) {
				struct sk_buff *newskb;

				if (is_vlan_tag) {
					skb_push(skb, 4);
					for (i = 0; i < 6; i++)
						*((unsigned short *)(skb->data + i * 2)) = *((unsigned short *)(skb->data + 4 + i * 2));
					*((__be16 *)(skb->data + MACADDRLEN * 2)) = __constant_htons(ETH_P_8021Q);
					*((unsigned short *)(skb->data + MACADDRLEN * 2 + 2)) = vlan_hdr;
				}
				newskb = rtw_skb_copy(skb);
				if (!newskb) {
					DEBUG_ERR("TX DROP: rtw_skb_copy fail!\n");
					return -1;
				}
				dev_kfree_skb_any(skb);
				*pskb = skb = newskb;
				if (is_vlan_tag) {
					vlan_hdr = *((unsigned short *)(skb->data + MACADDRLEN * 2 + 2));
					for (i = 0; i < 6; i++)
						*((unsigned short *)(skb->data + MACADDRLEN * 2 + 2 - i * 2)) = *((unsigned short *)(skb->data + MACADDRLEN * 2 - 2 - i * 2));
					skb_pull(skb, 4);
				}
			}
			if (skb_is_nonlinear(skb))
				DEBUG_ERR("%s(): skb_is_nonlinear!!\n", __func__);
#if (LINUX_VERSION_CODE < KERNEL_VERSION(2, 6, 18))
			res = skb_linearize(skb, GFP_ATOMIC);
#else	/* (LINUX_VERSION_CODE < KERNEL_VERSION(2, 6, 18)) */
			res = skb_linearize(skb);
#endif /* (LINUX_VERSION_CODE < KERNEL_VERSION(2, 6, 18)) */
			if (res < 0) {
				DEBUG_ERR("TX DROP: skb_linearize fail!\n");
				return -1;
			}

			res = nat25_db_handle(adapt, skb, NAT25_INSERT);
			if (res < 0) {
				if (res == -2) {
					DEBUG_ERR("TX DROP: nat25_db_handle fail!\n");
					return -1;

